Revit 2027 API
ParameterTypeId.StructuralBeamStartAttachmentType Property
 "Start Attachment Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamStartAttachmentType { get; }
Public Shared ReadOnly Property StructuralBeamStartAttachmentType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamStartAttachmentType {
	ForgeTypeId^ get ();
}
static member StructuralBeamStartAttachmentType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace